
#include <iostream>
using namespace std;


/**
* \brief Заменить минимальный элемент массива на средний (количество элементов – нечетно).
* \param min - Переменная для минимального элемента массива
*/
void replacement(int n, int i, int* arr);

/**
* \brief Удалить из него все элементы, в записи которых есть цифра 5.
* \param c - Временная переменная
*/
void burn(int n, int i, int* arr);

/**
* \brief Из элементов массива C сформировать массив A той же размерности по правилу: если номер i элемента четный, то Ai=Ci2, если нечетный, то Ai=2Ci.
* * \param *array - Массив заполняемый по определенным функциям
*/
void massive(int i, int n, int* arr, int* array);

void replacement(int n, int i, int *arr) // функция поиска минимального элемента и замены его на средний
{
	int min = 0;

	for (i = 0; i < n; i++)  // поиск минимального
	{
		if (arr[i] < min)
		{
			min = arr[i];
		}
	}
	cout << endl << "Минимальный элемент массива - " << min << endl;

	for (i = 0; i < n; i++) // замена минимального на средний
	{
		if (arr[i] == min)
		{
			arr[i] = arr[n / 2];
		}
	}
	cout << "Массив после замены минимального элемента на средний - ";
	for (i = 0; i < n; i++)
	{
		cout << arr[i] << " " ;
	}
}

void burn(int n, int i, int *arr) // функция поиска элементов массива в записи которых есть цифра 5 и замена их на 0
{
	int c; // временная переменная 
	for (i = 0; i < n; i++)
	{
		c = abs(arr[i]);

		while (c != 0)
		{
			if ((c % 10) == 5)
			{
				arr[i] = 0;
			}

			c /= 10;
		}

	}

	cout << endl << "Массив после удаления элементов с цифрой 5 в записи - ";
	for (i = 0; i < n; i++)
	{
		cout << arr[i] << " ";
	}
}

void massive(int i, int n, int *arr, int *array) // функция для заполнение второго массива
{
	for (i = 0; i < n; i++)
	{
		if (i % 2 == 0)
		{
			array[i] = arr[i] * arr[i];
		}
		else
		{
			array[i] = 2 * arr[i];
		}
	}
}

/**
* \brief точка входа в программу
* \param n - Переменная при вводе которой создается массив на n элементов
* \param a - Переменная при вводе 1 или 2 выбирается способ ввода элементов массива
* \param i - Переменная-счётчик
* \param *arr - Изначальный массив
* \return Код ошибки(0 - успех)
*/
int main()
{
	setlocale(LC_ALL, "Russian");
	int n, a;
	srand(time(0));
	cout << "Введите число элементов массива - ";
	cin >> n;
	cout << "Как хотите заполнить массив? Введите 1 для ручного заполнения. Введите 2 для заполнения случайными числами - ";
	cin >> a;

	int i;
	int* arr = new int[n]; //создание массива
	int* array = new int[n]; //создание массива A
	if (a == 1) //заполнение с клавиатуры
	{
		for (i = 0; i < n; i++)
		{
			cin >> arr[i];
		}
	}
	if (a == 2) //заполнение случайными числами
	{
		for (i = 0; i < n; i++)
		{
			arr[i] = rand() % 2000 - 1000;
		}
	}
	cout << "Ваш массив:"; // вывод массива
	for (i = 0; i < n; i++)
	{
		cout << arr[i] << " ";

	}

	if (n % 2 != 0) // условие для замены переменных в массиве
	{
		replacement(n, i, arr);
	}

	massive(i, n, arr, array);

	cout << endl << "Первый массив - ";
	for (i = 0; i < n; i++)
	{
		cout << arr[i] << " ";
	}

	cout << endl << "Второй массив - ";
	for (i = 0; i < n; i++)
	{
		cout << array[i] << " ";
	}

	burn(n, i, arr);


}

	
